In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import importlib
from numpy import nan
importlib.import_module('xlrd')

### Modify DATA

In [3]:
data = {
    "name" : ["Jinal", "Dhruvi","NIsha", "Rudra"],
    "Age"  : [23,21,23,17],
    "City" : ["Ahmedabad","Ahmedabad","Ahmedabad","Ahmedabad"]
}

df_data = pd.DataFrame(data)
print(df_data)

     name  Age       City
0   Jinal   23  Ahmedabad
1  Dhruvi   21  Ahmedabad
2   NIsha   23  Ahmedabad
3   Rudra   17  Ahmedabad

##### Modify through square brackets [ ]
df.rename(columns={'old_name': 'new_name'}, inplace=True)

In [ ]:
df_data["salary"] = [70000,750000,80000,85000]
print(df_data)

# through some calculation
df_data["bonus"] = df_data["salary"] * (0.1)
print(df_data)

     name  Age       City  salary    bonus
0   Jinal   23  Ahmedabad   70000   7000.0
1  Dhruvi   21  Ahmedabad  750000  75000.0
2   NIsha   23  Ahmedabad   80000   8000.0
3   Rudra   17  Ahmedabad   85000   8500.0
     name  Age       City  salary    bonus
0   Jinal   23  Ahmedabad   70000   7000.0
1  Dhruvi   21  Ahmedabad  750000  75000.0
2   NIsha   23  Ahmedabad   80000   8000.0
3   Rudra   17  Ahmedabad   85000   8500.0

##### Modify through insert()--> we can add at precise location --> add data

In [7]:
# df_data.insert(index or location, "column_name", data array or some data)
df_data.insert(0,"id",[2001,2002,2003,2004])
print(df_data)

     id    name  Age       City  salary    bonus
0  2001   Jinal   23  Ahmedabad   70000   7000.0
1  2002  Dhruvi   21  Ahmedabad  750000  75000.0
2  2003   NIsha   23  Ahmedabad   80000   8000.0
3  2004   Rudra   17  Ahmedabad   85000   8500.0

##### Updating data --> .loc[]

In [10]:
df_data.loc[0,"salary"] = 75000
print(df_data)

     id    name  Age       City  salary    bonus
0  2001   Jinal   23  Ahmedabad   75000   7000.0
1  2002  Dhruvi   21  Ahmedabad   75000  75000.0
2  2003   NIsha   23  Ahmedabad   80000   8000.0
3  2004   Rudra   17  Ahmedabad   85000   8500.0

##### Updating multiple values

In [11]:
# increasing salary by 15 %
df_data["salary"] = df_data["salary"] * (0.15)
print(df_data)

     id    name  Age       City   salary    bonus
0  2001   Jinal   23  Ahmedabad  11250.0   7000.0
1  2002  Dhruvi   21  Ahmedabad  11250.0  75000.0
2  2003   NIsha   23  Ahmedabad  12000.0   8000.0
3  2004   Rudra   17  Ahmedabad  12750.0   8500.0

##### Removing columns --> drop() method

In [15]:

# df_data["City"]= ["Ah","Ah","Ah","Ah"]
# print(df_data)


df_data.drop(columns=["City"], inplace=True)
#  To delete multiple columns --> add other column names here columns=["City","Age"] like this
print("Modified Data : ", df_data)

Modified Data :       id    name  Age   salary    bonus
0  2001   Jinal   23  11250.0   7000.0
1  2002  Dhruvi   21  11250.0  75000.0
2  2003   NIsha   23  12000.0   8000.0
3  2004   Rudra   17  12750.0   8500.0

#### Handling missing values --> None,NaN

In [16]:
df_data["City"]= ["Ah","Ah","Ah","Ah"]
print(df_data)

     id    name  Age   salary    bonus City
0  2001   Jinal   23  11250.0   7000.0   Ah
1  2002  Dhruvi   21  11250.0  75000.0   Ah
2  2003   NIsha   23  12000.0   8000.0   Ah
3  2004   Rudra   17  12750.0   8500.0   Ah

##### isnull method through

In [17]:
print(df_data)

     id    name  Age   salary    bonus City
0  2001   Jinal   23  11250.0   7000.0   Ah
1  2002  Dhruvi   21  11250.0  75000.0   Ah
2  2003   NIsha   23  12000.0   8000.0   Ah
3  2004   Rudra   17  12750.0   8500.0   Ah

##### Detect missing values

In [19]:
data = {
    "name" : ["Jinal", "Dhruvi",None, "Rudra"],
    "Age"  : [23,21,None,17],
    "City" : [None,"Ahmedabad","Ahmedabad","Ahmedabad"]
}

df_missing_data = pd.DataFrame(data)
print(df_missing_data)

     name   Age       City
0   Jinal  23.0       None
1  Dhruvi  21.0  Ahmedabad
2    None   NaN  Ahmedabad
3   Rudra  17.0  Ahmedabad

In [20]:
print(df_missing_data.isnull())

    name    Age   City
0  False  False   True
1  False  False  False
2   True   True  False
3  False  False  False

##### Sum of missing values

In [21]:
print(df_missing_data.isnull().sum())

name    1
Age     1
City    1
dtype: int64

##### How to handle missing values --> dropna(axis , inplace)

In [28]:
# it will remove all null values with their corrosponding rows and columns
print(df_missing_data.dropna())

     name   Age       City
0   Jinal  23.0          0
1  Dhruvi  21.0  Ahmedabad
2       0   0.0  Ahmedabad
3   Rudra  17.0  Ahmedabad

##### Fill missing values by fillna(value you want to pass, inplace=True)

In [58]:
# from numpy import nan


data = {
    "name" : ["Jinal", "Dhruvi","Nisha", "Rudra"],
    "Age"  : [23,21,nan,17],
    "City" : ["ch","Ahmedabad","Ahmedabad","Ahmedabad"]
}

df_missing_data = pd.DataFrame(data)
print(df_missing_data)

     name   Age       City
0   Jinal  23.0         ch
1  Dhruvi  21.0  Ahmedabad
2   Nisha   NaN  Ahmedabad
3   Rudra  17.0  Ahmedabad

##### Fill calculated value --> directly

In [65]:
# pandas understands 0 as real number so to 
# get the mean value i have to comment it 
# otherwise you have to replace it with 
# numpy nan and then fill it.
# ----------------------------------------------------------------------------
# df_missing_data.fillna(0,inplace=True)
# print(df_missing_data)
# ----------------------------------------------------------------------------
df_missing_data['Age'].fillna(df_missing_data['Age'].mean(), inplace=True)
print(df_missing_data)

     name        Age       City
0   Jinal  23.000000         ch
1  Dhruvi  21.000000  Ahmedabad
2   Nisha  20.333333  Ahmedabad
3   Rudra  17.000000  Ahmedabad

C:\Users\JINAL\AppData\Local\Temp\ipykernel_22100\3082959171.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_missing_data['Age'].fillna(df_missing_data['Age'].mean(), inplace=True)

##### Fill calculated value --> after replace or with numpy nan

In [ ]:
df_missing_data['Age'].fillna(df_missing_data['Age'].mean(), inplace=True)
print(df_missing_data)
# This line is only filling actual NaN values. 
# But in your DataFrame, it looks like the "missing" age is: 2   Nisha   0.0
# o pandas sees 0.0 as a real number — not missing.

# Replace 0 with NaN
df_missing_data['Age'].replace(0, np.nan, inplace=True)

# Now fill NaN with mean
df_missing_data['Age'] = df_missing_data['Age'].fillna(df_missing_data['Age'].mean())

# Print the result
print(df_missing_data)

     name        Age       City
0   Jinal  23.000000         ch
1  Dhruvi  21.000000  Ahmedabad
2   Nisha  20.333333  Ahmedabad
3   Rudra  17.000000  Ahmedabad
     name        Age       City
0   Jinal  23.000000         ch
1  Dhruvi  21.000000  Ahmedabad
2   Nisha  20.333333  Ahmedabad
3   Rudra  17.000000  Ahmedabad

C:\Users\JINAL\AppData\Local\Temp\ipykernel_22100\3311392390.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_missing_data['Age'].fillna(df_missing_data['Age'].mean(), inplace=True)
C:\Users\JINAL\AppData\Local\Temp\ipykernel_22100\3311392390.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_missing_data['Age'].replace(0, np.nan, inplace=True)

##### Interpolation

In [ ]:
d = {
    "name" : ["Jinal", "Dhruvi","Nisha", "Rudra","Dhruv","Nish", "Riya"],
    "Age"  : [23,21,None,17,19,None,24],
    "City" : ["ch","Ahmedabad","Ahmedabad","Ahmedabad","Ahmedabad","Ahmedabad","Ahmedabad"]
}

df = pd.DataFrame(d)
print(df)

# linear method
# df.interpolate(method="linear",axis=0,inplace=True)
df["Age"] = df["Age"].interpolate(method="linear")
print(df)

     name   Age       City
0   Jinal  23.0         ch
1  Dhruvi  21.0  Ahmedabad
2   Nisha   NaN  Ahmedabad
3   Rudra  17.0  Ahmedabad
4   Dhruv  19.0  Ahmedabad
5    Nish   NaN  Ahmedabad
6    Riya  24.0  Ahmedabad
     name   Age       City
0   Jinal  23.0         ch
1  Dhruvi  21.0  Ahmedabad
2   Nisha  19.0  Ahmedabad
3   Rudra  17.0  Ahmedabad
4   Dhruv  19.0  Ahmedabad
5    Nish  21.5  Ahmedabad
6    Riya  24.0  Ahmedabad

#####
🧠 Concept:
Suppose you have a DataFrame like:

Index	Age
0	20.0
1	NaN
2	NaN
3	26.0
You want to fill in the missing values (index 1 and 2) based on a straight line between 20 and 26.

📐 Step-by-Step Linear Interpolation:
Start value (index 0): 20.0
End value (index 3): 26.0
You are missing values at index 1 and 2 → two gaps = 3 total points (0, 1, 2, 3)

Interpolation formula:
For a missing index i between x₀ and x₁:

𝑦𝑖 = 𝑦0 + ((𝑦1−𝑦0)/(𝑥1−𝑥0)) × (i−x0)

🔢 Applying it:
Between index 0 (20.0) and index 3 (26.0)

Slope = (26 - 20) / (3 - 0) = 6 / 3 = 2

Then:
Index 1 → 20 + 2 × 1 = 22.0
Index 2 → 20 + 2 × 2 = 24.0

So the final result:

Index	Age
0	20.0
1	22.0
2	24.0
3	26.0

#### Selecting and filtering DATA

##### sorting through sort_values() --> 1column

In [14]:
a = {
    "Name" : ["Jinal","kanisha", "Tiku", "Nisha","Rudra"],
    "Salary" : [85000,99000,90000,96000,97000],
    "EmpID" : [2005,2004,2007,2006,2008]
}

df_sorting = pd.DataFrame(a)
print(a)

{'Name': ['Jinal', 'kanisha', 'Tiku', 'Nisha', 'Rudra'], 'Salary': [85000, 99000, 90000, 96000, 97000], 'EmpID': [2005, 2004, 2007, 2006, 2008]}

In [18]:
df_sorting.sort_values(by = "EmpID", ascending=True, inplace=True)

print(df_sorting)

      Name  Salary  EmpID
1  kanisha   99000   2004
0    Jinal   85000   2005
3    Nisha   96000   2006
2     Tiku   90000   2007
4    Rudra   97000   2008

##### Sorting multiple columns

In [19]:
df_sorting.sort_values(by = ["EmpID","Salary"], ascending=[True,False])
print(df_sorting)

      Name  Salary  EmpID
1  kanisha   99000   2004
0    Jinal   85000   2005
3    Nisha   96000   2006
2     Tiku   90000   2007
4    Rudra   97000   2008

##### Filter/ Aggregation on Data

In [23]:
avg_salary = df_sorting["Salary"].mean()
print("avg_salary : ",avg_salary)

min_salary = df_sorting["Salary"].min()
print("min_salary : ",min_salary)

max_salary = df_sorting["Salary"].max()
print("max_salary : ",max_salary)

sum_salary = df_sorting["Salary"].sum()
print("sum_salary : ",sum_salary)

avg_salary :  93400.0
min_salary :  85000
max_salary :  99000
sum_salary :  467000

##### Grouping data

In [24]:
b = {
    "Name" : ["Jinal","kanisha", "Tiku", "Nisha","Rudra"],
    "Salary" : [85000,99000,90000,96000,97000],
    "EmpID" : [2005,2004,2007,2006,2008]
}

df_grp = pd.DataFrame(b)
print(b)

{'Name': ['Jinal', 'kanisha', 'Tiku', 'Nisha', 'Rudra'], 'Salary': [85000, 99000, 90000, 96000, 97000], 'EmpID': [2005, 2004, 2007, 2006, 2008]}

In [25]:
df_grp.insert(2,"age",[23,24,21,23,18])
print(df_grp)

      Name  Salary  age  EmpID
0    Jinal   85000   23   2005
1  kanisha   99000   24   2004
2     Tiku   90000   21   2007
3    Nisha   96000   23   2006
4    Rudra   97000   18   2008

In [26]:
grp = df_grp.groupby("age")["Salary"].sum()
print(grp)

age
18     97000
21     90000
23    181000
24     99000
Name: Salary, dtype: int64

##### Multiple columns grouping

In [27]:
grp_multi = df_grp.groupby(["age","Name"])["Salary"].sum()
print(grp_multi)

age  Name
18   Rudra      97000
21   Tiku       90000
23   Jinal      85000
     Nisha      96000
24   kanisha    99000
Name: Salary, dtype: int64

#### Merging and Joining -->

In [35]:
# customer dataframe

df_cust = pd.DataFrame({
    "C_ID" :[1,2,3],
    "Name" : ["Nisha","Kanisha","Amisha"]
})

# order dataframe
df_order = pd.DataFrame({
    "C_ID" :[1,2,4],
    "OrderAmount" : [450,550,750]
})
# only matched keys data will be displayed 
df_merged = pd.merge(df_cust,df_order, on = "C_ID",how="inner")
print(df_merged)

# # all data will be displayed
df_merged = pd.merge(df_cust,df_order, on = "C_ID",how="outer")
print(df_merged)

# # all data will be displayed
df_merged = pd.merge(df_cust,df_order, on = "C_ID",how="left")
print(df_merged)

# # all data will be displayed
df_merged = pd.merge(df_cust,df_order, on = "C_ID",how="right")
print(df_merged)

   C_ID     Name  OrderAmount
0     1    Nisha          450
1     2  Kanisha          550
   C_ID     Name  OrderAmount
0     1    Nisha        450.0
1     2  Kanisha        550.0
2     3   Amisha          NaN
3     4      NaN        750.0
   C_ID     Name  OrderAmount
0     1    Nisha        450.0
1     2  Kanisha        550.0
2     3   Amisha          NaN
   C_ID     Name  OrderAmount
0     1    Nisha          450
1     2  Kanisha          550
2     4      NaN          750

#### Concatenation of dataframes -->join --> vertically or horizontally

In [40]:
# region 1 dataframe

df_r1 = pd.DataFrame({
    "C_ID" :[1,2,3],
    "Name" : ["Nisha","Kanisha","Amisha"]
})

# region 2 dataframe
df_r2 = pd.DataFrame({
    "C_ID" :[4,5,6],
    "Name" : ["Jinal","Bhakti","Dhruvi"]
})

# "concatenate vertically"
# df_concat = pd.concat([df_r1,df_r2], axis = 0, ignore_index= True)
# print("\n concatenate vertically \n",df_concat)

# concatenate horizontally
df_concat = pd.concat([df_r1,df_r2], axis = 1, ignore_index= True)
print("\n concatenate horizontally \n",df_concat)

 concatenate horizontally
    0        1  2       3
0  1    Nisha  4   Jinal
1  2  Kanisha  5  Bhakti
2  3   Amisha  6  Dhruvi